{
  "common": {
    "loading": "Carregando...",
    "error": "Erro",
    "success": "Sucesso",
    "continue": "Continuar",
    "back": "Voltar",
    "next": "Próximo",
    "submit": "Enviar",
    "cancel": "Cancelar",
    "close": "Fechar",
    "save": "Salvar",
    "delete": "Excluir",
    "edit": "Editar",
    "add": "Adicionar",
    "yes": "Sim",
    "no": "Não"
  },
  "quiz": {
    "title": "Quiz de Personalidade para Relacionamentos",
    "subtitle": "Descubra Seu Estilo de Relacionamento",
    "description": "Faça nosso quiz abrangente para entender sua personalidade em relacionamentos e receba conselhos personalizados para construir conexões mais fortes.",
    "startButton": "Iniciar Quiz",
    "question": "Pergunta",
    "of": "de",
    "previousQuestion": "Pergunta Anterior",
    "nextQuestion": "Próxima Pergunta",
    "calculateResults": "Calcular Resultados",
    "retakeQuiz": "Refazer Quiz",
    "shareResults": "Compartilhar Resultados"
  },
  "results": {
    "title": "Seus Resultados de Personalidade para Relacionamentos",
    "personalityInsights": "Insights de Personalidade",
    "relationshipTips": "Dicas para Melhorar Relacionamentos",
    "shareOnFacebook": "Compartilhar no Facebook",
    "takeQuizAgain": "Refazer Quiz",
    "yourType": "Seu Tipo",
    "score": "Pontuação",
    "maxScore": "Pontuação Máxima",
    "percentage": "Porcentagem"
  },
  "payment": {
    "title": "Complete Sua Compra",
    "description": "Pagamento seguro para desbloquear seus insights personalizados de relacionamento",
    "amount": "Valor",
    "processing": "Processando...",
    "processing_message": "O pagamento está sendo processado. Aguarde...",
    "failed": "Falha no pagamento",
    "button_pay": "Pagar",
    "success": "Pagamento realizado com sucesso! Seus resultados estão sendo preparados...",
    "save_success": "Seus resultados do quiz foram salvos com sucesso!",
    "save_warning": "Pagamento realizado com sucesso, mas houve um problema ao salvar seus resultados. Entre em contato com o suporte se necessário."
  },
  "questions": {
    "q1": "Como você normalmente lida com conflitos em relacionamentos?",
    "q1_option_1": "Prefiro abordar questões imediatamente e diretamente.",
    "q1_option_2": "Preciso de tempo para processar antes de discutir o problema.",
    "q1_option_3": "Tento encontrar um compromisso que funcione para todos.",
    "q1_option_4": "Às vezes evito confrontos para manter a paz.",
    "q2": "O que é mais importante para você em um relacionamento?",
    "q2_option_1": "Comunicação aberta e honesta.",
    "q2_option_2": "Confiança e lealdade.",
    "q2_option_3": "Apoio emocional e compreensão.",
    "q2_option_4": "Crescimento e experiências compartilhadas.",
    "q3": "Como você expressa afeto ao seu parceiro?",
    "q3_option_1": "Através de toque físico e proximidade.",
    "q3_option_2": "Dando presentes ou fazendo atos de serviço atenciosos.",
    "q3_option_3": "Com palavras de afirmação e elogios.",
    "q3_option_4": "Passando tempo de qualidade juntos.",
    "q4": "Ao tomar decisões importantes com um parceiro, você prefere:",
    "q4_option_1": "Assumir a liderança e tomar decisões com confiança.",
    "q4_option_2": "Discutir todas as opções minuciosamente antes de decidir juntos.",
    "q4_option_3": "Considerar as necessidades do seu parceiro primeiro.",
    "q4_option_4": "Ser flexível e seguir o fluxo.",
    "q5": "Como você reage quando se sente emocionalmente ferido por alguém próximo?",
    "q5_option_1": "Expresso meus sentimentos imediatamente e diretamente.",
    "q5_option_2": "Me retiro e processo minhas emoções privadamente.",
    "q5_option_3": "Tento entender a perspectiva deles antes de reagir.",
    "q5_option_4": "Tendo a perdoar rapidamente e seguir em frente."
  },
  "personality_types": {
    "communicator": {
      "title": "O Comunicador",
      "description": "Você valoriza comunicação aberta e honesta em relacionamentos. Você é direto sobre suas necessidades e sentimentos, o que ajuda a prevenir mal-entendidos.",
      "personality_advice_1": "Pratique escuta ativa para equilibrar sua franqueza com empatia.",
      "personality_advice_2": "Lembre-se de que nem todos processam emoções tão rapidamente quanto você.",
      "personality_advice_3": "Sua honestidade é um presente, mas o momento e a forma de entrega importam.",
      "personality_advice_4": "Crie espaços seguros para outros compartilharem seus pensamentos sem julgamento.",
      "personality_advice_5": "Use suas habilidades de comunicação para construir pontes, não muros.",
      "relationship_advice_1": "Faça perguntas abertas para encorajar conversas mais profundas.",
      "relationship_advice_2": "Pratique paciência quando outros precisam de tempo para articular seus sentimentos.",
      "relationship_advice_3": "Procure parceiros que apreciem sua franqueza e possam corresponder ao seu estilo de comunicação.",
      "relationship_advice_4": "Equilibre falar com ouvir em seus relacionamentos.",
      "relationship_advice_5": "Use declarações em primeira pessoa para expressar suas necessidades sem deixar outros na defensiva."
    },
    "harmonizer": {
      "title": "O Harmonizador",
      "description": "Você se destaca em criar equilíbrio e paz em relacionamentos. Sua capacidade de ver múltiplas perspectivas faz de você um mediador natural e parceiro solidário.",
      "personality_advice_1": "Não sacrifique suas próprias necessidades em prol de manter a paz.",
      "personality_advice_2": "Pratique expressar suas preferências, mesmo quando podem criar pequenos conflitos.",
      "personality_advice_3": "Sua empatia é uma força, mas lembre-se de estabelecer limites saudáveis.",
      "personality_advice_4": "Confie que relacionamentos saudáveis podem lidar com algum desentendimento.",
      "personality_advice_5": "Valorize suas habilidades de pacificação enquanto honra seu eu autêntico.",
      "relationship_advice_1": "Comunique suas necessidades claramente, mesmo se parecer desconfortável no início.",
      "relationship_advice_2": "Pratique dizer 'não' quando pedidos não se alinham com seus valores ou capacidade.",
      "relationship_advice_3": "Procure parceiros que valorizem compromisso tanto quanto você.",
      "relationship_advice_4": "Aborde pequenas questões antes que se tornem problemas maiores.",
      "relationship_advice_5": "Celebre a força em sua adaptabilidade e habilidades de pacificação."
    },
    "independent": {
      "title": "O Independente",
      "description": "Você valoriza autonomia e crescimento pessoal em relacionamentos. Você traz um forte senso de si mesmo e limites claros para suas conexões.",
      "personality_advice_1": "Equilibre independência com vulnerabilidade para conexões mais profundas.",
      "personality_advice_2": "Compartilhe seu processo interno com pessoas de confiança.",
      "personality_advice_3": "Reconheça quando a autossuficiência se torna uma barreira para a intimidade.",
      "personality_advice_4": "Pratique pedir ajuda quando necessário.",
      "personality_advice_5": "Sua autossuficiência é uma força que traz estabilidade aos relacionamentos.",
      "relationship_advice_1": "Comunique sua necessidade de espaço proativamente, não reativamente.",
      "relationship_advice_2": "Crie rituais de conexão para equilibrar sua independência.",
      "relationship_advice_3": "Procure parceiros que respeitem sua autonomia sem se sentirem ameaçados.",
      "relationship_advice_4": "Invista em interdependência junto com independência.",
      "relationship_advice_5": "Compartilhe sua jornada de crescimento com aqueles mais próximos de você."
    },
    "loyalist": {
      "title": "O Leal",
      "description": "Você prioriza confiança e compromisso em relacionamentos. Sua confiabilidade e dedicação criam uma base segura para conexões profundas.",
      "personality_advice_1": "Certifique-se de que sua lealdade aos outros não substitua a lealdade a si mesmo.",
      "personality_advice_2": "Reconheça que a confiança pode ser reconstruída após pequenas violações.",
      "personality_advice_3": "Equilibre consistência com espontaneidade e crescimento.",
      "personality_advice_4": "Permita a si mesmo e aos outros espaço para evoluir e mudar.",
      "personality_advice_5": "Sua firmeza fornece segurança valiosa em relacionamentos.",
      "relationship_advice_1": "Comunique suas expectativas claramente para evitar decepções.",
      "relationship_advice_2": "Pratique perdão para pequenas transgressões.",
      "relationship_advice_3": "Procure parceiros que valorizem compromisso tanto quanto você.",
      "relationship_advice_4": "Construa confiança através de pequenas ações consistentes ao longo do tempo.",
      "relationship_advice_5": "Crie espaço tanto para segurança quanto para aventura em seus relacionamentos."
     }
   },
   "admin": {
    "title": "Painel Administrativo",
    "stats": "Estatísticas",
    "users": "Usuários",
    "quizzes": "Quizzes",
    "results": "Resultados",
    "payments": "Pagamentos"
  },
  "errors": {
    "generic": "Algo deu errado. Tente novamente.",
    "network": "Erro de rede. Verifique sua conexão.",
    "validation": "Por favor, preencha todos os campos obrigatórios.",
    "payment": "Falha no processamento do pagamento. Tente novamente.",
    "quiz": "Falha ao calcular resultados do quiz. Tente novamente."
  }
}